biskwee-app/app/controllers/ingred_lines_controller.rb

  def index
    @ingred_lines = IngredLine.all
---
SELECT "ingred_lines".* FROM "ingred_lines"