biskwee-app/app/controllers/ingredients_controller.rb

INSERT INTO "ingredients" ("name", "category_id", "unit_id", "unit_cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "buttnugget"], ["category_id", 7], ["unit_id", 15], ["unit_cost", 500.0], ["created_at", "2020-03-08 21:26:31.060342"], ["updated_at", "2020-03-08 21:26:31.060342"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    if @ingredient.save

UPDATE "ingredients" SET "unit_cost" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["unit_cost", 500.0], ["updated_at", "2020-03-08 21:25:43.481284"], ["id", 30]]
---
  def update
    if @ingredient.update(ingredient_params)

DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 40]]
---
  def destroy
    @ingredient.destroy