biskwee-app/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "yield_qty", "unit_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "tissues"], ["yield_qty", 5.0], ["unit_id", 6], ["created_at", "2020-03-08 20:02:05.959019"], ["updated_at", "2020-03-08 20:02:05.959019"]]

	def add_ingredient
		# puts params
		# @ingredient=Ingredient.find(params[:ingredient_id])
		# @recipe.ingredients << @ingredient
		# render json: @recipe.ingredients
		@r=Recipe.find(2)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

	def update
		@recipe=Recipe.find(params[:id])
		@recipe.update(recipe_params)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "recipes" SET "method" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["method", "{\"grab a damn tissue\",\"blow your fucking nose\"}"], ["updated_at", "2020-03-08 20:30:13.383209"], ["id", 5]]