biskwee-app/app/controllers/registrations_controller.rb

  def create
    @user = User.new(sign_up_params)
    if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"