biskwee-app/app/controllers/units_controller.rb

  def index
    @units = Unit.all
---
SELECT "units".* FROM "units"